In [11]:
import pandas as pd
# this "firm" variable is really "last firm" but the database manager called it what they called it 
# and now IT is scared that fixing it will break all their systems, so it's "stuck as-is"
some_employees = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue', 'Anderson'],
                    'firm': ['Citi','GS','Accenture','Wells Fargo', 'Lehigh'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR', 'Finance'],
                    'hire_date': [2004, 2008, 2012, 2014, 2020]})

departments = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR', 'Janitors'],
                    'employees': [100,200,1, 2] })

current_employer = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'firm': ['Yahoo','Yahoo','Yahoo','Yahoo'],})

some_employees_alt = pd.DataFrame({'employee': ['Jonathan', 'Mary', 'Lisa', 'Sue'],
                    'firm': ['?','Lehigh','Accenture','Wells Fargo'],
                    'group': ['Accounting', 'CEO', 'Engineering', 'HR'],
                    'hire_date': [2010, 2019, 2012, 2014]})

In [12]:
some_employees

   employee         firm        group  hire_date
0       Bob         Citi   Accounting       2004
1      Jake           GS  Engineering       2008
2      Lisa    Accenture  Engineering       2012
3       Sue  Wells Fargo           HR       2014
4  Anderson       Lehigh      Finance       2020

In [13]:
current_employer

  employee   firm
0      Bob  Yahoo
1     Jake  Yahoo
2     Lisa  Yahoo
3      Sue  Yahoo

In [14]:
departments

         group  employees
0   Accounting        100
1  Engineering        200
2           HR          1
3     Janitors          2

In [15]:
some_employees_alt

   employee         firm        group  hire_date
0  Jonathan            ?   Accounting       2010
1      Mary       Lehigh          CEO       2019
2      Lisa    Accenture  Engineering       2012
3       Sue  Wells Fargo           HR       2014

In [16]:
some_employees.merge(departments, on='group')

  employee         firm        group  hire_date  employees
0      Bob         Citi   Accounting       2004        100
1     Jake           GS  Engineering       2008        200
2     Lisa    Accenture  Engineering       2012        200
3      Sue  Wells Fargo           HR       2014          1

In [18]:
temp = some_employees.merge(departments, on='group', how='outer')

In [20]:
some_employees.isnull().sum()

employee     0
firm         0
group        0
hire_date    0
dtype: int64

In [22]:
departments.isnull().sum()

group        0
employees    0
dtype: int64

In [21]:
temp.isnull().sum()

employee     1
firm         1
group        0
hire_date    1
employees    1
dtype: int64

In [30]:
some_employees.merge(current_employer, on='employee', how='left', suffixes=('_prior','_currrent'))

   employee   firm_prior        group  hire_date firm_currrent
0       Bob         Citi   Accounting       2004         Yahoo
1      Jake           GS  Engineering       2008         Yahoo
2      Lisa    Accenture  Engineering       2012         Yahoo
3       Sue  Wells Fargo           HR       2014         Yahoo
4  Anderson       Lehigh      Finance       2020           NaN